Repository: AVBelyy/TSWeb
Catalog: flask/tsweb/translations/*/LC_MESSAGES/messages.po
Languages: ru

source: Invalid team name
ru: Неверный логин

source: Non-empty password expected
ru: Ожидался непустой пароль

source: Thank you for logging in, {0}!
ru: Спасибо за вход, {0}!

source: No solution presented
ru: Пустое решение

source: Unknown problem '{0}'
ru: Неизвестная задача '{0}'

source: Unknown compiler '{0}'
ru: Неизвестный компилятор '{0}'

source: Your contest has been changed to {0}, {1}!
ru: Ваша тренировка изменилась на {0}, {1}!

source: Login error: session data missing or expired
ru: Ошибка авторизации: данные отсутствуют или устарели

source: Authentification Error
ru: Ошибка авторизации

source: TestSys reports following error: {0}
ru: TestSys сообщает об ошибке: {0}

source: TestSys reports unknown error
ru: TestSys сообщает о неизвестной ошибке

source: TestSys error
ru: Ошибка TestSys

source: Empty response from testsys
ru: Пустой ответ от TestSys

source: Submits list
ru: Все решения

source: Problem
ru: Задача

source: Team
ru: Участник

source: Attempt
ru: Попытка

source: Time
ru: Время

source: Compiler
ru: Компилятор

source: Result
ru: Результат

source: Test
ru: Тест

source: MaxTime
ru: Макс. время

source: MaxMem
ru: Макс. память

source: Text
ru: Код

source: Comment
ru: Комментарий

source: CE Cause
ru: Ошибка компиляции

source: Score
ru: Очки

source: View
ru: Открыть

source: Your clarification request has been acknowledged! Good luck!
ru: Ваш вопрос отправлен! Решайте задачи дальше! Жюри ответит когда будет время!

source: Testsys Clarification Request
ru: TestSys &mdash; задать вопрос

source: Clarification Requests
ru: Вопросы по задачам

source: From
ru: От кого

source: Question
ru: Вопрос

source: Answer
ru: Ответ

source: Answered
ru: Отвечен?

source: Broadcast
ru: Для всех?

source: Problem:<br/><i>Choose here the problem id</i>
ru: Задача:<br/><i>Выберите задачу</i>

source: Clarification text:
ru: Ваш вопрос:

source: Submit Clarification Request
ru: Отправить вопрос

source: List of contests
ru: Все тренировки

source: Contest ID
ru: ID тренировки

source: Click to enter
ru: Нажмите, чтобы войти

source: Contest Name
ru: Название тренировки

source: Click to read statements
ru: Нажмите, чтобы открыть условия

source: State
ru: Состояние

source: Started at
ru: Время начала

source: Teams count
ru: Количество участников

source: Error
ru: Ошибка

source: Main page
ru: Главная

source: Feedback for submission %(id)s
ru: Результат тестирования #%(id)s

source: New messages
ru: Новые сообщения

source: Sorry, no new messages
ru: Нет новых сообщений

source: Click here to confirm
ru: Нажмите здесь для подтверждения

source: You are currently not logged in.
ru: Спросите у преподавателя логин и пароль и войдите в систему.

source: Password
ru: Пароль

source: Login
ru: Войти

source: Remove all cookies
ru: Очистить cookies

source: You are logged as %(team)s - %(name)s
ru: Вы: %(team)s - %(name)s

source: Log out
ru: Выйти

source: Messages:
ru: Сообщения:

source: %(num)s new message pending
ru: Ожидает %(num)s новое сообщение

source: No messages
ru: Нет сообщений

source: TestSys version: <strong>%(version)s</strong>
ru: Версия TestSys: <strong>%(version)s</strong>

source: Assigned contest: <strong>%(contid)s %(contname)s</strong>
ru: Вы решаете: <strong>%(contid)s %(contname)s</strong>

source: Contest starts at <strong>%(contest_start)s</strong> and lasts <strong>%(contest_duration)s</strong> minutes, current TestSys time is <strong>%(server_now)s</strong>
ru: Тренировка началась <strong>%(contest_start)s</strong>, длительность <strong>%(contest_duration)s</strong> минут, время на тестирующем сервере <strong>%(server_now)s</strong>

source: Language:
ru: Язык:

source: Save
ru: Сохранить

source: Submit
ru: Отправить решение

source: Monitor
ru: Рейтинг

source: Clarifications
ru: Вопросы

source: Submissions
ru: Отправки

source: Statements
ru: Условия задач

source: Print solution
ru: Печать решения

source: All contests
ru: Все тренировки

source: All submissions
ru: Все отправки

source: Contest Monitor
ru: Рейтинг тренировки

source: Started at: <b>%(startat)s</b>
ru: Начало: <b>%(startat)s</b>

source: Duration: <b>%(duration)s</b>
ru: Длительность: <b>%(duration)s</b>

source: State: <b>%(state)s %(mins)s/%(contlen)s</b>
ru: Состояние: <b>%(state)s %(mins)s/%(contlen)s</b>

source: Last success: %(htime)s, team <b>%(team)s</b> &mdash; <b>%(name)s</b>, problem <b>%(problem)s</b>
ru: Последний успех: %(htime)s, <b>%(team)s</b> &mdash; <b>%(name)s</b>, задача <b>%(problem)s</b>

source: Last submission: %(htime)s, team <b>%(team)s</b> &mdash; <b>%(name)s</b>, problem <b>%(problem)s</b>
ru: Последняя отправка: %(htime)s, <b>%(team)s</b> &mdash; <b>%(name)s</b>, задача <b>%(problem)s</b>

source: Rank
ru: Рейтинг

source: Submits
ru: Отправлено решений

source: Accepted
ru: Принятно &mdash; accepted

source: Rejected
ru: Отклонено &mdash; rejected

source: Teams list
ru: Список участников

source: Click here if you are not redirected automatically.
ru: Нажмите сюда, если вы не были перенаправлены автоматически.

source: Testsys submit
ru: Отправить решение

source: Language:<br /><i>Choose one of the compilers</i>
ru: Язык:<br/><i>Выберите компилятор/интерпретатор </i>

source: Solution:<br /><i>Attach here your solution</i>
ru: Решение:<br /><i>Загрузите ваше решение...</i>

source: Solution text:<br /><i>... or paste it here</i>
ru: Текст решения:<br /><i>...или вставьте его сюда</i>

source: Submit status
ru: Статус отправки

source: Your solution has been submitted. However, no response has been received from Testsys.
ru: Ваше решение было отправлено на проверку, однако ответ от TestSys не был получен.

source: Your submission has been acknowledged! Good luck!
ru: Ваше решение отправлено на проверку! Удачи!

source: Submission source
ru: Исходный код

source: Raw
ru: Только код
